# Day - 14 DIY

**Q1. Problem Statement: Handling Null Values**

Load the “titanic.csv”file provided on LMS into a DataFrame, find the columns with null values, and drop all the rows in DataFrame with null values to create a new DataFrame.

In [16]:
#PROBLEM STATEMNET-1
#cleaning the titanic.csv file
import pandas as pd
#load the dataset
data = pd.read_csv("titanic.csv")
df = pd.DataFrame(data)
print(df)

     Unnamed: 0  Survived  Pclass  \
0           NaN         0       3
1         893.0         1       3
2         894.0         0       2
3         895.0         0       3
4         896.0         1       3
..          ...       ...     ...
413      1305.0         0       3
414      1306.0         1       1
415      1307.0         0       3
416      1308.0         0       3
417      1309.0         0       3

                                             Name     Sex   Age  SibSp  Parch  \
0                                Kelly, Mr. James    male  34.5      0      0
1                Wilkes, Mrs. James (Ellen Needs)  female  47.0      1      0
2                       Myles, Mr. Thomas Francis    male  62.0      0      0
3                                Wirz, Mr. Albert    male  27.0      0      0
4    Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female  22.0      1      1
..                                            ...     ...   ...    ...    ...
413                            Spector, Mr. Woolf    male   NaN      0      0
414                  Oliva y Ocana, Dona. Fermina  female  39.0      0      0
415                  Saether, Mr. Simon Sivertsen    male  38.5      0      0
416                           Ware, Mr. Frederick    male   NaN      0      0
417                      Peter, Master. Michael J    male   NaN      1      1

                 Ticket      Fare Cabin Embarked
0                330911    7.8292   NaN        Q
1                363272    7.0000   NaN        S
2                240276    9.6875   NaN        Q
3                315154    8.6625   NaN        S
4               3101298   12.2875   NaN        S
..                  ...       ...   ...      ...
413           A.5. 3236    8.0500   NaN        S
414            PC 17758  108.9000  C105        C
415  SOTON/O.Q. 3101262    7.2500   NaN        S
416              359309    8.0500   NaN        S
417                2668   22.3583   NaN        C

[418 rows x 12 columns]

In [10]:
#find columns with null values 
null_counts = df.isnull().sum()
print("Identifying null values:\n", null_counts)

Identifying null values:
 Unnamed: 0      1
Survived        0
Pclass          0
Name            0
Sex             0
Age            86
SibSp           0
Parch           0
Ticket          0
Fare            1
Cabin         327
Embarked        0
dtype: int64

In [11]:
#drop rows with null values
df_cleaned = df.dropna()
print("\nDropping null values:\n", df_cleaned)

Dropping null values:
      Unnamed: 0  Survived  Pclass  \
12        904.0         1       1
14        906.0         1       1
24        916.0         1       1
26        918.0         1       1
28        920.0         0       1
..          ...       ...     ...
404      1296.0         0       1
405      1297.0         0       2
407      1299.0         0       1
411      1303.0         1       1
414      1306.0         1       1

                                                  Name     Sex   Age  SibSp  \
12       Snyder, Mrs. John Pillsbury (Nelle Stevenson)  female  23.0      1
14   Chaffee, Mrs. Herbert Fuller (Carrie Constance...  female  47.0      1
24     Ryerson, Mrs. Arthur Larned (Emily Maria Borie)  female  48.0      1
26                        Ostby, Miss. Helene Ragnhild  female  22.0      0
28                             Brady, Mr. John Bertram    male  41.0      0
..                                                 ...     ...   ...    ...
404                       Frauenthal, Mr. Isaac Gerald    male  43.0      1
405       Nourney, Mr. Alfred (Baron von Drachstedt")"    male  20.0      0
407                         Widener, Mr. George Dunton    male  50.0      1
411    Minahan, Mrs. William Edward (Lillian E Thorpe)  female  37.0      1
414                       Oliva y Ocana, Dona. Fermina  female  39.0      0

     Parch         Ticket      Fare            Cabin Embarked
12       0          21228   82.2667              B45        S
14       0    W.E.P. 5734   61.1750              E31        S
24       3       PC 17608  262.3750  B57 B59 B63 B66        C
26       1         113509   61.9792              B36        C
28       0         113054   30.5000              A21        S
..     ...            ...       ...              ...      ...
404      0          17765   27.7208              D40        C
405      0  SC/PARIS 2166   13.8625              D38        C
407      1         113503  211.5000              C80        C
411      0          19928   90.0000              C78        Q
414      0       PC 17758  108.9000             C105        C

[87 rows x 12 columns]

In [13]:
#data frame showing true/false for null values
null_values_df = df.isnull()
print(null_values_df)

     Unnamed: 0  Survived  Pclass   Name    Sex    Age  SibSp  Parch  Ticket  \
0          True     False   False  False  False  False  False  False   False
1         False     False   False  False  False  False  False  False   False
2         False     False   False  False  False  False  False  False   False
3         False     False   False  False  False  False  False  False   False
4         False     False   False  False  False  False  False  False   False
..          ...       ...     ...    ...    ...    ...    ...    ...     ...
413       False     False   False  False  False   True  False  False   False
414       False     False   False  False  False  False  False  False   False
415       False     False   False  False  False  False  False  False   False
416       False     False   False  False  False   True  False  False   False
417       False     False   False  False  False   True  False  False   False

      Fare  Cabin  Embarked
0    False   True     False
1    False   True     False
2    False   True     False
3    False   True     False
4    False   True     False
..     ...    ...       ...
413  False   True     False
414  False  False     False
415  False   True     False
416  False   True     False
417  False   True     False

[418 rows x 12 columns]

In [12]:
#print the shape of the original and cleaned DataFrames
print("Original DataFrame shape:", df.shape)
print("cleaned DataFrame shape:", df_cleaned.shape)

Original DataFrame shape: (418, 12)
cleaned DataFrame shape: (87, 12)

In [8]:
#save the cleaned Dataframe to a new csv file
df_cleaned.to_csv("titanic_cleaned.csv", index = False)
df2 = pd.read_csv("titanic_cleaned.csv")
print(df2)

    Unnamed: 0  Survived  Pclass  \
0        904.0         1       1
1        906.0         1       1
2        916.0         1       1
3        918.0         1       1
4        920.0         0       1
..         ...       ...     ...
82      1296.0         0       1
83      1297.0         0       2
84      1299.0         0       1
85      1303.0         1       1
86      1306.0         1       1

                                                 Name     Sex   Age  SibSp  \
0       Snyder, Mrs. John Pillsbury (Nelle Stevenson)  female  23.0      1
1   Chaffee, Mrs. Herbert Fuller (Carrie Constance...  female  47.0      1
2     Ryerson, Mrs. Arthur Larned (Emily Maria Borie)  female  48.0      1
3                        Ostby, Miss. Helene Ragnhild  female  22.0      0
4                             Brady, Mr. John Bertram    male  41.0      0
..                                                ...     ...   ...    ...
82                       Frauenthal, Mr. Isaac Gerald    male  43.0      1
83       Nourney, Mr. Alfred (Baron von Drachstedt")"    male  20.0      0
84                         Widener, Mr. George Dunton    male  50.0      1
85    Minahan, Mrs. William Edward (Lillian E Thorpe)  female  37.0      1
86                       Oliva y Ocana, Dona. Fermina  female  39.0      0

    Parch         Ticket      Fare            Cabin Embarked
0       0          21228   82.2667              B45        S
1       0    W.E.P. 5734   61.1750              E31        S
2       3       PC 17608  262.3750  B57 B59 B63 B66        C
3       1         113509   61.9792              B36        C
4       0         113054   30.5000              A21        S
..    ...            ...       ...              ...      ...
82      0          17765   27.7208              D40        C
83      0  SC/PARIS 2166   13.8625              D38        C
84      1         113503  211.5000              C80        C
85      0          19928   90.0000              C78        Q
86      0       PC 17758  108.9000             C105        C

[87 rows x 12 columns]

**Q2. Problem Statement: Handling Duplicate Values**

Load the “titanic.csv”file provided on LMS into a DataFrame, find out the fields in the dataset with duplicate values based on the “Ticket” column, and drop all the rows with duplicate values to create a new DataFrame.

In [14]:

#finding out the duplicate "ticket"values
duplicate_rows = df[df.duplicated(subset = 'Ticket', keep=False)]

#drop duplicate rows based on "ticket"
df_without_duplicates = df.drop_duplicates(subset = "Ticket", keep ="first")

#print the data frame withot duplicate rows 
print("\nDataFrame without Duplicates: \n", df_without_duplicates)

DataFrame without Duplicates:
      Unnamed: 0  Survived  Pclass  \
0           NaN         0       3
1         893.0         1       3
2         894.0         0       2
3         895.0         0       3
4         896.0         1       3
..          ...       ...     ...
413      1305.0         0       3
414      1306.0         1       1
415      1307.0         0       3
416      1308.0         0       3
417      1309.0         0       3

                                             Name     Sex   Age  SibSp  Parch  \
0                                Kelly, Mr. James    male  34.5      0      0
1                Wilkes, Mrs. James (Ellen Needs)  female  47.0      1      0
2                       Myles, Mr. Thomas Francis    male  62.0      0      0
3                                Wirz, Mr. Albert    male  27.0      0      0
4    Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female  22.0      1      1
..                                            ...     ...   ...    ...    ...
413                            Spector, Mr. Woolf    male   NaN      0      0
414                  Oliva y Ocana, Dona. Fermina  female  39.0      0      0
415                  Saether, Mr. Simon Sivertsen    male  38.5      0      0
416                           Ware, Mr. Frederick    male   NaN      0      0
417                      Peter, Master. Michael J    male   NaN      1      1

                 Ticket      Fare Cabin Embarked
0                330911    7.8292   NaN        Q
1                363272    7.0000   NaN        S
2                240276    9.6875   NaN        Q
3                315154    8.6625   NaN        S
4               3101298   12.2875   NaN        S
..                  ...       ...   ...      ...
413           A.5. 3236    8.0500   NaN        S
414            PC 17758  108.9000  C105        C
415  SOTON/O.Q. 3101262    7.2500   NaN        S
416              359309    8.0500   NaN        S
417                2668   22.3583   NaN        C

[363 rows x 12 columns]